#### [`repos`] Terraform Plan 📖`success`

<a href="https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-w1JmEJ1JE3UtjXA4" target="_blank">Remote Plan Link ↗️</a>

<details><summary>Show Plan</summary>

```tf
Running plan in the remote backend. Output will stream here. Pressing Ctrl-C
will stop streaming the logs, but will not stop the plan running remotely.

Preparing the remote plan...

To view this run in a browser, visit:
https://app.terraform.io/app/cdktf-team/prebuilt-providers/runs/run-w1JmEJ1JE3UtjXA4

Waiting for the plan to start...

Terraform v1.4.6
on linux_amd64
Initializing plugins and modules...
data.github_team.cdktf-team-cdktf: Reading...
data.github_team.cdktf-team-cdktf: Read complete after 3s [id=6602018]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  - destroy

Terraform will perform the following actions:

  # github_actions_secret.cdktf-provider-acme_repo_secret-alert-prs-slack-webhook-url_4F24D503 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-alert-prs-slack-webhook-url_4F24D503" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_98D9A13D will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_98D9A13D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F930E70D will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F930E70D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-gh-token_9EC1B4B4 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-gh-token_9EC1B4B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-maven-gpg-private-key-passphrase_958B9629 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-maven-gpg-private-key-passphrase_958B9629" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-maven-gpg-private-key_08E3EF06 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-maven-gpg-private-key_08E3EF06" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-maven-password_67E6B0B4 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-maven-password_67E6B0B4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-maven-staging-profile-id_57A45A90 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-maven-staging-profile-id_57A45A90" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-maven-username_F6D2BE44 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-maven-username_F6D2BE44" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-npm-token_BA514DB3 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-npm-token_BA514DB3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-nuget-api-key_898F76CC will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-nuget-api-key_898F76CC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-twine-password_000F0F5D will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-twine-password_000F0F5D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-acme_repo_secret-twine-username_62814344 will be created
  + resource "github_actions_secret" "cdktf-provider-acme_repo_secret-twine-username_62814344" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-acme"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-alert-prs-slack-webhook-url_92B98743 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-alert-prs-slack-webhook-url_92B98743" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3AFE704F will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_3AFE704F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A7E1560 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_6A7E1560" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-gh-token_0D56BA0D will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-gh-token_0D56BA0D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-maven-gpg-private-key-passphrase_0CAC4008 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-maven-gpg-private-key-passphrase_0CAC4008" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-maven-gpg-private-key_037481B3 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-maven-gpg-private-key_037481B3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-maven-password_66B64BC8 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-maven-password_66B64BC8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-maven-staging-profile-id_5480F9C5 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-maven-staging-profile-id_5480F9C5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-maven-username_4833DFB6 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-maven-username_4833DFB6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-npm-token_7FF97805 will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-npm-token_7FF97805" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-nuget-api-key_2110B3EC will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-nuget-api-key_2110B3EC" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-twine-password_1799C7BE will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-twine-password_1799C7BE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-archive_repo_secret-twine-username_0D67B53E will be created
  + resource "github_actions_secret" "cdktf-provider-archive_repo_secret-twine-username_0D67B53E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-archive"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-alert-prs-slack-webhook-url_29982F86 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-alert-prs-slack-webhook-url_29982F86" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_8FD4ADB3 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_8FD4ADB3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3A7BDF5E will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3A7BDF5E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-gh-token_B92AC48E will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-gh-token_B92AC48E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-maven-gpg-private-key-passphrase_0B54C43A will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-maven-gpg-private-key-passphrase_0B54C43A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-maven-gpg-private-key_51ED4608 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-maven-gpg-private-key_51ED4608" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-maven-password_772F7705 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-maven-password_772F7705" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-maven-staging-profile-id_B4409CFE will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-maven-staging-profile-id_B4409CFE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-maven-username_17C580E4 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-maven-username_17C580E4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-npm-token_D2C104B7 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-npm-token_D2C104B7" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-nuget-api-key_018820E1 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-nuget-api-key_018820E1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-twine-password_8F36B2EF will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-twine-password_8F36B2EF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-aws_repo_secret-twine-username_3A9D3F13 will be created
  + resource "github_actions_secret" "cdktf-provider-aws_repo_secret-twine-username_3A9D3F13" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-aws"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-alert-prs-slack-webhook-url_41B46379 will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-alert-prs-slack-webhook-url_41B46379" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1DC8B21E will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_1DC8B21E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F07E6821 will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F07E6821" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-gh-token_EDA022FF will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-gh-token_EDA022FF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-maven-gpg-private-key-passphrase_4753D8F8 will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-maven-gpg-private-key-passphrase_4753D8F8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-maven-gpg-private-key_45C307D2 will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-maven-gpg-private-key_45C307D2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-maven-password_A1B2E5CE will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-maven-password_A1B2E5CE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-maven-staging-profile-id_D888A3C0 will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-maven-staging-profile-id_D888A3C0" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-maven-username_9CCCF6BA will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-maven-username_9CCCF6BA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-npm-token_32820C6E will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-npm-token_32820C6E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-nuget-api-key_97A5C7BF will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-nuget-api-key_97A5C7BF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-twine-password_947B9A3E will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-twine-password_947B9A3E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azuread_repo_secret-twine-username_C8C2056A will be created
  + resource "github_actions_secret" "cdktf-provider-azuread_repo_secret-twine-username_C8C2056A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azuread"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_76F8529C will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-alert-prs-slack-webhook-url_76F8529C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_490AF334 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_490AF334" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F37B6293 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_F37B6293" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-gh-token_B9F04536 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-gh-token_B9F04536" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-gpg-private-key-passphrase_2A5862C8 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-maven-gpg-private-key-passphrase_2A5862C8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-gpg-private-key_20A9A492 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-maven-gpg-private-key_20A9A492" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-password_E040DE4B will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-maven-password_E040DE4B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-staging-profile-id_577F09F8 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-maven-staging-profile-id_577F09F8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-maven-username_005A8995 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-maven-username_005A8995" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-npm-token_504E009A will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-npm-token_504E009A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-nuget-api-key_B379FCE6 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-nuget-api-key_B379FCE6" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-twine-password_3D259DCA will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-twine-password_3D259DCA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-azurerm_repo_secret-twine-username_7037FAE3 will be created
  + resource "github_actions_secret" "cdktf-provider-azurerm_repo_secret-twine-username_7037FAE3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-azurerm"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-alert-prs-slack-webhook-url_C0A9CCA9 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-alert-prs-slack-webhook-url_C0A9CCA9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_7757EE88 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_7757EE88" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FCB43B0C will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_FCB43B0C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-gh-token_8459A2EE will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-gh-token_8459A2EE" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-maven-gpg-private-key-passphrase_98D29609 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-maven-gpg-private-key-passphrase_98D29609" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-maven-gpg-private-key_30C242D4 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-maven-gpg-private-key_30C242D4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-maven-password_3268CB55 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-maven-password_3268CB55" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-maven-staging-profile-id_F498261A will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-maven-staging-profile-id_F498261A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-maven-username_00E5250D will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-maven-username_00E5250D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-npm-token_7B685BE3 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-npm-token_7B685BE3" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-nuget-api-key_A931AD3A will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-nuget-api-key_A931AD3A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-twine-password_C155BB93 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-twine-password_C155BB93" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudflare_repo_secret-twine-username_94FA0D9D will be created
  + resource "github_actions_secret" "cdktf-provider-cloudflare_repo_secret-twine-username_94FA0D9D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudflare"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_CB98C20F will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-alert-prs-slack-webhook-url_CB98C20F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_486C432F will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_486C432F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9C4A7955 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_9C4A7955" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-gh-token_302BE373 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-gh-token_302BE373" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-maven-gpg-private-key-passphrase_E5B2D77E will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-maven-gpg-private-key-passphrase_E5B2D77E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-maven-gpg-private-key_44795075 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-maven-gpg-private-key_44795075" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-maven-password_F13EB918 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-maven-password_F13EB918" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-maven-staging-profile-id_5ED1534A will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-maven-staging-profile-id_5ED1534A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-maven-username_4D849438 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-maven-username_4D849438" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-npm-token_C6DCF110 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-npm-token_C6DCF110" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-nuget-api-key_A091B563 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-nuget-api-key_A091B563" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-twine-password_18638A3D will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-twine-password_18638A3D" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-cloudinit_repo_secret-twine-username_CC1EAF74 will be created
  + resource "github_actions_secret" "cdktf-provider-cloudinit_repo_secret-twine-username_CC1EAF74" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-cloudinit"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-alert-prs-slack-webhook-url_1514499C will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-alert-prs-slack-webhook-url_1514499C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_372CF04A will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_372CF04A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8995830F will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_8995830F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-gh-token_1BA71D0A will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-gh-token_1BA71D0A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-maven-gpg-private-key-passphrase_5BEF5DBB will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-maven-gpg-private-key-passphrase_5BEF5DBB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-maven-gpg-private-key_7A76D48F will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-maven-gpg-private-key_7A76D48F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-maven-password_95FB6933 will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-maven-password_95FB6933" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-maven-staging-profile-id_5BDCA15B will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-maven-staging-profile-id_5BDCA15B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-maven-username_A4CAC87E will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-maven-username_A4CAC87E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-npm-token_D58F7830 will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-npm-token_D58F7830" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-nuget-api-key_6D2BAC35 will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-nuget-api-key_6D2BAC35" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-twine-password_1539C008 will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-twine-password_1539C008" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-databricks_repo_secret-twine-username_D51430C9 will be created
  + resource "github_actions_secret" "cdktf-provider-databricks_repo_secret-twine-username_D51430C9" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-databricks"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-alert-prs-slack-webhook-url_B7DC75BA will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-alert-prs-slack-webhook-url_B7DC75BA" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B0CD4CDF will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_B0CD4CDF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3E1F5BD8 will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_3E1F5BD8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-gh-token_2123096E will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-gh-token_2123096E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-maven-gpg-private-key-passphrase_384ABAF4 will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-maven-gpg-private-key-passphrase_384ABAF4" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-maven-gpg-private-key_CF14A31B will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-maven-gpg-private-key_CF14A31B" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-maven-password_6424AEFF will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-maven-password_6424AEFF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-maven-staging-profile-id_8B99250E will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-maven-staging-profile-id_8B99250E" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-maven-username_B230298C will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-maven-username_B230298C" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-npm-token_6E86F6BF will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-npm-token_6E86F6BF" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-nuget-api-key_DF9FB246 will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-nuget-api-key_DF9FB246" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-twine-password_854C96D2 will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-twine-password_854C96D2" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "TWINE_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-datadog_repo_secret-twine-username_5964E5B8 will be created
  + resource "github_actions_secret" "cdktf-provider-datadog_repo_secret-twine-username_5964E5B8" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-datadog"
      + secret_name     = "TWINE_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-alert-prs-slack-webhook-url_32D52CE1 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-alert-prs-slack-webhook-url_32D52CE1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "ALERT_PRS_SLACK_WEBHOOK_URL"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_196F796F will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-gh-token-alias-GO_GITHUB_TOKEN_196F796F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "GO_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_AE7520E5 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-gh-token-alias-PROJEN_GITHUB_TOKEN_AE7520E5" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "PROJEN_GITHUB_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-gh-token_EAA6B267 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-gh-token_EAA6B267" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "GH_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-maven-gpg-private-key-passphrase_0B581E11 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-maven-gpg-private-key-passphrase_0B581E11" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY_PASSPHRASE"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-maven-gpg-private-key_DC6E6CF1 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-maven-gpg-private-key_DC6E6CF1" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "MAVEN_GPG_PRIVATE_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-maven-password_EEC71B1F will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-maven-password_EEC71B1F" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "MAVEN_PASSWORD"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-maven-staging-profile-id_7A32BD1A will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-maven-staging-profile-id_7A32BD1A" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "MAVEN_STAGING_PROFILE_ID"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-maven-username_85CDE0CB will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-maven-username_85CDE0CB" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "MAVEN_USERNAME"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-npm-token_B7200999 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-npm-token_B7200999" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "NPM_TOKEN"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-nuget-api-key_14C20E41 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-nuget-api-key_14C20E41" {
      + created_at      = (known after apply)
      + id              = (known after apply)
      + plaintext_value = (sensitive value)
      + repository      = "cdktf-provider-digitalocean"
      + secret_name     = "NUGET_API_KEY"
      + updated_at      = (known after apply)
    }

  # github_actions_secret.cdktf-provider-digitalocean_repo_secret-twine-password_06CAD7B7 will be created
  + resource "github_actions_secret" "cdktf-provider-digitalocean_repo_secret-twine-password_06CAD7B7" {
      + created_at      = (known aft...
```

</details>

*Pusher: @DanielMSchmidt, Action: `pull_request`, Working Directory: ``, Workflow: `Plan`*